#include <stdio.h>

extern void startGame(int letters, int rounds) {

    // Here goes the game logic

    printf("The game begins!\n");

    /*

    1. Във всеки рунд се генерират няколко на брой букви и се изписват на екрана.
    2. Потребителят въвежда дума, която се състои само от предоставените букви.
        - При въвеждане на невалидна дума (която съдържа други букви или повече от подадения брой от дадена буква) се
        извежда съобщение за грешка и се преминава към стъпка 2.
        - При въвеждане на валидна дума се изчисляват точките ѝ (по подразбиране всяка буква е 1 точка) и се прибавят към
        общите точки на потребителя.
    3. Докато не свършат рундовете се връщаме към точка 2.
    4. При приключване на последния рунд се изписва крайния резултат на играча и се връща в основното меню.

    */
}